---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotZ
source: html/e851270e-d6c9-85d3-1eaf-9d28b9f81dd0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotZ Property

"Z Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionRotZ { get; }
```